src/Documents/Приходная/Приходная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Приходная</name>
  <registerRecords>InformationRegister.ПокупкиОтдельнымМестом</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыВПосылках</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиНаСкладе</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставкиСвернуто</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>InformationRegister.ОчередьРазбора</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.НеВыгруженноНаСайт</registerRecords>
  <registerRecords>InformationRegister.НегабаритЗначения</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставки</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <registerRecords>AccumulationRegister.Приход</registerRecords>
  <registerRecords>AccumulationRegister.КПолучению</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Транзит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>МультиОрг</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыПриходов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДелаемГрупповойСтикер</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СвояТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <comment>Номер покупки</comment>
      <type>
        <types>CatalogRef.Покупки</types>
        <types>CatalogRef.Заказы</types>
        <types>CatalogRef.Пристрой</types>
        <types>Number</types>
        <types>CatalogRef.Коробки</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.Организаторы</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтдельнымМестом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОргСбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <comment>Размер покупки</comment>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>КодПокупки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предупреждение</name>
      <type>
        <types>EnumRef.ПредупрежденияПрихода</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Посылки</name>
    <attributes>
      <name>Посылка</name>
      <type>
        <types>CatalogRef.Посылки</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтдельнымМестом</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеОшибки</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отправлено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Загружено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплачен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/УчастникиВГруппах/УчастникиВГруппах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчастникиВГруппах</name>
  <dimensions>
    <name>Группа</name>
    <type>
      <types>CatalogRef.ГруппыУчастников</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/AccumulationRegisters/КПолучению/КПолучению.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>КПолучению</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Покупка</name>
    <type>
      <types>DefinedType.ТипыЗаказа</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументВыдачи</name>
    <type>
      <types>DocumentRef.ВыдачаТранзита</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/ТипыОбменов100сп/ТипыОбменов100сп.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОбменов100сп</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВозврата</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Карты</name>
  </enumValues>
  <enumValues>
    <name>Транзит</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппа</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппаРегистрация</name>
  </enumValues>
  <enumValues>
    <name>СуперГруппаКолено</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаПосылок</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеПристроя</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаЯндекс</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыПриходов/ТипыПриходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПриходов</name>
  <enumValues>
    <name>НаСклад</name>
  </enumValues>
  <enumValues>
    <name>НаТранзит</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтУчастника</name>
  </enumValues>
  <enumValues>
    <name>ПристройНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ПристройНаТранзит</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/Посылки/Посылки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Посылки</name>
  <attributes>
    <name>Участник</name>
    <type>
      <types>CatalogRef.Участники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПерваяТочка</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктВыдачи</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Покупка</name>
    <type>
      <types>DefinedType.ТипыЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>Догрузить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>secureCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШК</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организаторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перезаполнить</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БесплатнаяВыдача</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>DefinedType.ТипыЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>КодЗаказа</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/Приходная/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	СтоСП_Печать.ДобавитьКомандыПечатиПоступлений(КомандыПечати);
КонецПроцедуры


#КонецОбласти





#Область Проведение

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка);
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	ТекстыЗапроса = Новый СписокЗначений;
	//СтоСПОбмен_Общий.Получить_ТекстЗапроса_Обмен100сп (Запрос, ТекстыЗапроса, Регистры);
	СтоСПОбмен_Общий.Получить_ТекстЗапроса_Обмен100СП_РН(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_НеВыгруженноНаСайт(Запрос, ТекстыЗапроса, Регистры);	
	Получить_ТекстЗапроса_Обмен100СПрн_Ошибки (Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_ЗаказыВПосылках(Запрос, ТекстыЗапроса, Регистры);
	
	
	Получить_ТекстЗапроса_ОстаткиНаСкладе(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_ОстаткиТоваров(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_Приход(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_Транзит(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_КПолучению(Запрос, ТекстыЗапроса, Регистры);
	Получить_ТекстЗапроса_ШтрафныеЗаказы(Запрос, ТекстыЗапроса, Регистры);
	
	ПроведениеСервер.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений, Истина);
	
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка)
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеДокумента.Ссылка КАК Ссылка,
	|	ДанныеДокумента.ПометкаУдаления КАК ПометкаУдаления,
	|	ДанныеДокумента.Номер КАК Номер,
	|	ДанныеДокумента.Дата КАК Период,
	|	ДанныеДокумента.Проведен КАК Проведен,
	|	ДанныеДокумента.Комментарий КАК Комментарий
	|ИЗ
	|	Документ.Приходная КАК ДанныеДокумента
	|ГДЕ
	|	ДанныеДокумента.Ссылка = &Ссылка";
	
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",                        Реквизиты.Период);
	Запрос.УстановитьПараметр("Номер",                         Реквизиты.Номер);
	Запрос.УстановитьПараметр("ИдентификаторМетаданных",       ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяОбъекта()));
	Запрос.УстановитьПараметр("Комментарий",                   Реквизиты.Комментарий);
	Запрос.УстановитьПараметр("ПометкаУдаления",               Реквизиты.ПометкаУдаления);
	Запрос.УстановитьПараметр("Проведен",                      Реквизиты.Проведен); 
	Запрос.УстановитьПараметр("гпНеПринимать",                 Константы.гпНеПринимать.Получить());
	Запрос.УстановитьПараметр("СвойПунктВыдачи",               Константы.СвояТочка.Получить()); 
	Запрос.УстановитьПараметр("ВозможностьИспользоватьТранзит",Константы.ВозможностьПриниматьНаТранзит.Получить());
	Запрос.УстановитьПараметр("Курьер100сп",				   Константы.ПунктВыдачиКурьерскойДоставки.Получить());
	Запрос.УстановитьПараметр("ИгнорироватьОшибкуИзмененияПунктаНазначения",				   Константы.ИгнорироватьОшибкуИзмененияПунктаНазначения.Получить());
	
КонецПроцедуры

#КонецОбласти


#Область Обмен100сп
Функция ПолучитьТэг_Income(Ссылка,НомерСтроки=Неопределено) Экспорт
	ОтборПоСсылке=?(ТипЗнч(Ссылка)=Тип("Массив")," В (&Ссылка) "," = &Ссылка ");
	ОтборПоСтроке=?(ТипЗнч(Ссылка)=Тип("Массив")," В (&НомерСтроки) "," = &НомерСтроки ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяПокупки.Оплачен КАК Оплачен,
		|	ПриходнаяПокупки.ДатаПриема КАК ДатаПриема,
		|	ПриходнаяПокупки.МестоХранения КАК МестоХранения,
		|	ПриходнаяПокупки.Габарит КАК Габарит,
		|	ПриходнаяПокупки.Ссылка.Транзит КАК Транзит,
		|	ПриходнаяПокупки.Ссылка.Дата КАК Дата,
		|	ПриходнаяПокупки.ШК КАК ШК,
		|	ПриходнаяПокупки.ОтдельнымМестом КАК ОтдельнымМестом,
		|	ПриходнаяПокупки.ОргСбор КАК ОргСбор,
		|	ПриходнаяПокупки.Ссылка.Номер КАК Номер
		|ИЗ
		|	Документ.Приходная.Покупки КАК ПриходнаяПокупки
		|ГДЕ
		|	ПриходнаяПокупки.Ссылка "+ОтборПоСсылке+" "+?(НомерСтроки=Неопределено,"", "
		|	И ПриходнаяПокупки.НомерСтроки "+ОтборПоСтроке+" ");
	
	Запрос.УстановитьПараметр("НомерСтроки", НомерСтроки);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда Возврат ""; КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ЗаписьXML=новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Служебный");
	Пока Выборка.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("income");
		СтоСП.Вставить_Тэг(ЗаписьXML,"paid"	,				?(Выборка.Оплачен,1,0));
		СтоСП.Вставить_Тэг(ЗаписьXML,"date"	,				?(ЗначениеЗаполнено(Выборка.ДатаПриема),Выборка.ДатаПриема,Выборка.Дата));
		СтоСП.Вставить_Тэг(ЗаписьXML,"uid"	, 				Формат(Число(Выборка.ШК.Участник.Код),"ЧГ=0"));
		СтоСП.Вставить_Тэг(ЗаписьXML,"orgid", 				Формат(Число(Выборка.ШК.Организатор.Код),"ЧГ=0"));
		СтоСП.Вставить_Тэг(ЗаписьXML,"sizedCategoryName",     Выборка.МестоХранения.Наименование);
		СтоСП.Вставить_Тэг(ЗаписьXML,"arrivalNumber",         Прав(Выборка.Номер,(СтрДлина(Выборка.Номер)-3)));
		СтоСП.Вставить_Тэг(ЗаписьXML,"sizedCategoryNumber",   СтоСП.ПолучитьПредставлениеГабарита(Выборка.Габарит));
		СтоСП.Вставить_Тэг(ЗаписьXML,"transit",               ?(Выборка.Транзит,1,0));
		СтоСП.Вставить_Тэг(ЗаписьXML,"isBig",                 ?(Выборка.Габарит.НеГабарит,1,0));
		СтоСП.Вставить_Тэг(ЗаписьXML,"isFree",                ?(Выборка.ОтдельнымМестом,1,0));
		СтоСП.Вставить_Тэг(ЗаписьXML,"DistributorFee",        ?(Выборка.ОргСбор,1,0));
		СтоСПОбмен_Общий.ЗаполнитьТэгиЗаказаПо_ШК(Выборка.ШК,ЗаписьXML);	
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
    ЗаписьXML.ЗаписатьКонецЭлемента();
	рез=ЗаписьXML.Закрыть();
	рез=СтрЗаменить(рез,"<Служебный>","");
	рез=СтрЗаменить(рез,"</Служебный>","");
	Возврат рез;
КонецФункции

Функция ПолучитьТэг_Income_Посылки(Ссылка,НомерСтроки=Неопределено) Экспорт
	ОтборПоСсылке=?(ТипЗнч(Ссылка)=Тип("Массив")," В (&Ссылка) "," = &Ссылка ");
	ОтборПоСтроке=?(ТипЗнч(Ссылка)=Тип("Массив")," В (&НомерСтроки) "," = &НомерСтроки ");
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяПосылки.Посылка 			КАК Посылка,
		|	ПриходнаяПосылки.ПунктВыдачи 		КАК ПунктВыдачи,
		|	ПриходнаяПосылки.МестоХранения 		КАК МестоХранения,
		|	ПриходнаяПосылки.Габарит 			КАК Габарит,
		|	ПриходнаяПосылки.ДатаПриема 		КАК ДатаПриема,
		|	ПриходнаяПосылки.Ссылка.СвояТочка 	КАК СвояТочка,
		|	ПриходнаяПосылки.Ссылка.Дата 		КАК Дата,
		|	ПриходнаяПосылки.ОтдельнымМестом 	КАК ОтдельнымМестом,
		|	ПриходнаяПосылки.Ссылка.Номер 		КАК Номер,
		|	ПриходнаяПосылки.Ссылка.Транзит 	КАК Транзит
		|ИЗ
		|	Документ.Приходная.Посылки КАК ПриходнаяПосылки
		|ГДЕ
		|	ПриходнаяПосылки.Ссылка "+ОтборПоСсылке+" "+?(НомерСтроки=Неопределено,"", "
		|	И ПриходнаяПосылки.НомерСтроки "+ОтборПоСтроке+" ");
	
	Запрос.УстановитьПараметр("НомерСтроки", 	НомерСтроки);
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда Возврат ""; КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ЗаписьXML=новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");	
	ЗаписьXML.ЗаписатьНачалоЭлемента("Служебный");
	Пока Выборка.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("income");
		СтоСП.Вставить_Тэг(ЗаписьXML,"paid"	,				1);
		СтоСП.Вставить_Тэг(ЗаписьXML,"date"	,				?(ЗначениеЗаполнено(Выборка.ДатаПриема),Выборка.ДатаПриема,Выборка.Дата));
		СтоСП.Вставить_Тэг(ЗаписьXML,"sizedCategoryName",   Выборка.МестоХранения.Наименование);
		СтоСП.Вставить_Тэг(ЗаписьXML,"arrivalNumber",       Прав(Выборка.Номер,(СтрДлина(Выборка.Номер)-3)));
		СтоСП.Вставить_Тэг(ЗаписьXML,"sizedCategoryNumber", СтоСП.ПолучитьПредставлениеГабарита(Выборка.Габарит));
		СтоСП.Вставить_Тэг(ЗаписьXML,"transit",             ?(Выборка.ПунктВыдачи<>Выборка.СвояТочка,1,0));
		

		СтоСП.Вставить_Тэг(ЗаписьXML,"isBig",               ?(Выборка.Габарит.НеГабарит,1,0));
		СтоСП.Вставить_Тэг(ЗаписьXML,"isFree",              ?(Выборка.ОтдельнымМестом,1,0));
		СтоСП.Вставить_Тэг(ЗаписьXML,"DistributorFee",      0);                                  //Орг сбор
		СтоСП.Вставить_Тэг(ЗаписьXML,"packageId",           Формат(Выборка.Посылка.Код,"ЧГ=0"));
		СтоСП.Вставить_Тэг(ЗаписьXML,"orderType",           "package");
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	рез=ЗаписьXML.Закрыть();
	рез=СтрЗаменить(рез,"<Служебный>","");
	рез=СтрЗаменить(рез,"</Служебный>","");
	
	Возврат рез;
КонецФункции

#КонецОбласти


Функция ПолноеИмяОбъекта()
	Возврат "Документ.Приходная";
КонецФункции


Функция Получить_ТекстЗапроса_НеВыгруженноНаСайт(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "НеВыгруженноНаСайт";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.Приходная") Тогда
		 ТекстЗапроса = "
		 |
		 |ВЫБРАТЬ
		 |	ПриходнаяПосылки.Ссылка.Дата КАК Период,
		 |	ПриходнаяПосылки.Посылка КАК Посылка,
		 |	ПриходнаяПосылки.МестоХранения КАК МестоХранения,
		 |	ПриходнаяПосылки.Габарит КАК Габарит,
		 |	Значение(Справочник.Коробки.БезКоробки) КАК Коробка,
		 |	ПриходнаяПосылки.ПунктВыдачи КАК ПунктВыдачи,
		 |	ПриходнаяПосылки.Ссылка КАК Партия,
		 |	1 КАК Количество
		 |ИЗ
		 |	Документ.Приходная.Посылки КАК ПриходнаяПосылки
		 |ГДЕ
		 |	ПриходнаяПосылки.Ссылка = &Ссылка
		 |	И НЕ ПриходнаяПосылки.Отправлено
		 |
		 |";
	КонецЕсли;	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция Получить_ТекстЗапроса_Обмен100СПрн_Ошибки (Запрос, ТекстыЗапроса, Регистры)
	ИмяРегистра = "Обмен100СПрн_Ошибки";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 

	
	ТекстЗапроса =  "
					|
					|ВЫБРАТЬ
	                |	ПриходнаяПосылки.Ссылка.Дата КАК Период,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	                |	ЗНАЧЕНИЕ(Перечисление.ТипыОбменов100сп.ЗагрузкаПосылок) КАК типОбмена,
	                |	ПриходнаяПосылки.Ссылка КАК Партия,
	                |	ПриходнаяПосылки.НомерСтроки КАК СтрокаВПартии,
	                |	ПриходнаяПосылки.ШК КАК Мегаордер,
	                |	""Не загруженна посылка!"" КАК СообщениеОшибки,
	                |	1 КАК КоличествоНеИсправленных
	                |ИЗ
	                |	Документ.Приходная.Посылки КАК ПриходнаяПосылки
	                |ГДЕ
	                |	ПриходнаяПосылки.Ссылка = &Ссылка
	                |	И НЕ ПриходнаяПосылки.Отправлено
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ПриходнаяПосылки.Ссылка.Дата,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	                |	ЗНАЧЕНИЕ(Перечисление.ТипыОбменов100сп.ЗагрузкаПосылок),
	                |	ПриходнаяПосылки.Ссылка,
	                |	ПриходнаяПосылки.НомерСтроки,
	                |	ПриходнаяПосылки.ШК,
	                |	""Не загружен состав посылки (для Объединенной доставки)!"",
	                |	1
	                |ИЗ
	                |	Документ.Приходная.Посылки КАК ПриходнаяПосылки
	                |ГДЕ
	                |	ПриходнаяПосылки.Ссылка = &Ссылка
	                |	И ПриходнаяПосылки.Посылка.ПунктВыдачи.ТранспортнаяКомпания
	                |	И НЕ ПриходнаяПосылки.Загружено
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ПриходнаяПосылки.Ссылка.Дата,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	                |	ЗНАЧЕНИЕ(Перечисление.ТипыОбменов100сп.ЗагрузкаПосылок),
	                |	ПриходнаяПосылки.Ссылка,
	                |	ПриходнаяПосылки.НомерСтроки,
	                |	ПриходнаяПосылки.ШК,
	                |	""Изменился пункт назначения посылки!"",
	                |	1
	                |ИЗ
	                |	Документ.Приходная.Посылки КАК ПриходнаяПосылки
	                |ГДЕ
	                |	ПриходнаяПосылки.Ссылка = &Ссылка
	                |	И ПриходнаяПосылки.Отправлено
	                |	И (	ПриходнаяПосылки.Посылка.ПунктВыдачи <> ПриходнаяПосылки.ПунктВыдачи)
		            |	и (не &ИгнорироватьОшибкуИзмененияПунктаНазначения
	                |	или РазборКоробкиПосылки.Посылка.ПунктВыдачи.ТранспортнаяКомпания
	                |	или РазборКоробкиПосылки.ПунктВыдачи.ТранспортнаяКомпания
	                |	
	                |)

					|
			        |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ПриходнаяПосылки.Ссылка.Дата,
	                |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	                |	ЗНАЧЕНИЕ(Перечисление.ТипыОбменов100сп.ЗагрузкаПосылок),
	                |	ПриходнаяПосылки.Ссылка,
	                |	ПриходнаяПосылки.НомерСтроки,
	                |	ПриходнаяПосылки.ШК,
	                |	""Участник из не приемной группы!"",
	                |	1
	                |ИЗ
	                |	Документ.Приходная.Посылки КАК ПриходнаяПосылки
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчастникиВГруппах КАК УчастникиВГруппах
	                |		ПО ПриходнаяПосылки.Посылка.Участник = УчастникиВГруппах.Участник
	                |			И (УчастникиВГруппах.Группа = &гпНеПринимать)
	                |ГДЕ
	                |	ПриходнаяПосылки.Ссылка = &Ссылка
	                |	И ПриходнаяПосылки.Отправлено
					|	И НЕ ПриходнаяПосылки.Ссылка.Транзит
					
					|";
	
	
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;
КонецФункции

Функция Получить_ТекстЗапроса_ЗаказыВПосылках(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "ЗаказыВПосылках";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.Приходная") Тогда
		ТекстЗапроса = "
					   |
					   |ВЫБРАТЬ
		               |	ПосылкиСостав.Ссылка КАК Посылка,
		               |	&Период КАК Период,
		               |	ПосылкиСостав.Покупка КАК Покупка,
		               |	ПосылкиСостав.Участник КАК Участник,
		               |	ПосылкиСостав.КодЗаказа КАК КодЗаказа,
		               |	&Ссылка КАК Партия,
		               |	1 КАК Количество
		               |ИЗ
		               |	Справочник.Посылки.Состав КАК ПосылкиСостав
		               |ГДЕ
		               |	ПосылкиСостав.Ссылка В
		               |			(ВЫБРАТЬ
		               |				ПриходнаяПосылки.Посылка КАК Посылка
		               |			ИЗ
		               |				Документ.Приходная.Посылки КАК ПриходнаяПосылки
		               |			ГДЕ
		               |				ПриходнаяПосылки.Ссылка = &Ссылка
		               |				И ПриходнаяПосылки.Загружено
					   |				И ПриходнаяПосылки.Посылка.ПунктВыдачи.ТранспортнаяКомпания)
					   |
					   |";
	КонецЕсли;	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция Получить_ТекстЗапроса_ОстаткиТоваров(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "ОстаткиТоваров";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.Приходная") Тогда
		ТекстЗапроса ="
		               |
					   |ВЫБРАТЬ
		               |	ПриходнаяПосылки.Ссылка.Дата КАК Период,
		               |	ПриходнаяПосылки.Посылка КАК Покупка,
		               |	ПриходнаяПосылки.МестоХранения КАК МестоХранения,
		               |	ПриходнаяПосылки.Габарит КАК Габарит,
		               |	ПриходнаяПосылки.Посылка.Участник КАК Участник,
		               |	ИСТИНА КАК Оплачен,
		               |	ЛОЖЬ КАК Потерян,
		               |	ПриходнаяПосылки.Ссылка КАК Партия,
		               |	1 КАК Количество
		               |ИЗ
		               |	Документ.Приходная.Посылки КАК ПриходнаяПосылки
		               |ГДЕ
		               //|	не ПриходнаяПосылки.Ссылка.Транзит
		               |	ПриходнаяПосылки.ПунктВыдачи = &СвойПунктВыдачи 
		               |	и ПриходнаяПосылки.Посылка.ПунктВыдачи <> &Курьер100сп
					   |	и ПриходнаяПосылки.Ссылка= &Ссылка
		               |	И ПриходнаяПосылки.Отправлено
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПриходнаяПокупки.Ссылка.Дата,
		               |	ПриходнаяПокупки.Покупка,
		               |	ПриходнаяПокупки.МестоХранения,
		               |	ПриходнаяПокупки.Габарит,
		               |	ПриходнаяПокупки.Участник,
		               |	ПриходнаяПокупки.Оплачен,
		               |	ЛОЖЬ,
		               |	ПриходнаяПокупки.Ссылка,
		               |	Выбор когда ТипЗначения(ПриходнаяПокупки.Покупка)=Тип(Справочник.Коробки) Тогда 1 Иначе ПриходнаяПокупки.Количество Конец как Количество
		               |ИЗ
		               |	Документ.Приходная.Покупки КАК ПриходнаяПокупки
		               |ГДЕ
					   |	не ПриходнаяПокупки.Ссылка.Транзит 
		               |	и ПриходнаяПокупки.Ссылка = &Ссылка
					   |
					   |";
	КонецЕсли;	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция Получить_ТекстЗапроса_Приход(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "Приход";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.Приходная") Тогда
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ПриходнаяПосылки.Ссылка.Дата КАК Период,
		               |	ПриходнаяПосылки.Габарит КАК Габарит,
		               |	ПриходнаяПосылки.МестоХранения КАК МестоХранения,
		               |	ПриходнаяПосылки.Посылка.Организатор КАК Организатор,
		               |	ПриходнаяПосылки.Посылка КАК Покупка,
		               |	1 КАК Количество,
		               |	ЗНАЧЕНИЕ(Справочник.Коробки.БезКоробки) КАК Коробка,
		               |	ВЫБОР
		               |		Когда 		ПриходнаяПосылки.Посылка.ПунктВыдачи = &Курьер100сп или
		               |					(ПриходнаяПосылки.ПунктВыдачи <> &СвойПунктВыдачи и ПриходнаяПосылки.ПунктВыдачи = ПриходнаяПосылки.Посылка.ПунктВыдачи )  Тогда
		               |				ЗНАЧЕНИЕ(Перечисление.ТипыПриходов.НаТранзит)
		               |		КОГДА НЕ ПриходнаяПосылки.Ссылка.Транзит 
		               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПриходов.НаСклад)
		               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПриходов.НаТранзит)
		               |	КОНЕЦ КАК ТипПрихода,
		               |	ПриходнаяПосылки.ОтдельнымМестом КАК ОтдельнымМестом,
		               |	ПриходнаяПосылки.Посылка.Участник КАК Участник
		               |ИЗ
		               |	Документ.Приходная.Посылки КАК ПриходнаяПосылки
		               |ГДЕ
		            //   |	ПриходнаяПосылки.Отправлено
		               |	 ПриходнаяПосылки.Ссылка = &Ссылка
		               |	И НЕ ПриходнаяПосылки.Ссылка.ДелаемГрупповойСтикер
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ПриходнаяПокупки.Ссылка.Дата,
		               |	ПриходнаяПокупки.Габарит,
		               |	ПриходнаяПокупки.МестоХранения КАК МестоХранения,
		               |	ВЫБОР
		               |		КОГДА ТИПЗНАЧЕНИЯ(ПриходнаяПокупки.Покупка) = ТИП(Справочник.Покупки)
		               |			ТОГДА ПриходнаяПокупки.Покупка.Владелец
		               |		ИНАЧЕ ПриходнаяПокупки.Покупка.Организатор
		               |	КОНЕЦ,
		               |	ПриходнаяПокупки.Покупка,
		               |	ВЫБОР
		               |		КОГДА ТИПЗНАЧЕНИЯ(ПриходнаяПокупки.Покупка) = ТИП(Справочник.Коробки)
		               |			ТОГДА 1
		               |		ИНАЧЕ ПриходнаяПокупки.Количество
		               |	КОНЕЦ,
			           |	ЗНАЧЕНИЕ(Справочник.Коробки.БезКоробки),
		               |	ВЫБОР
		               |		КОГДА НЕ ПриходнаяПокупки.Ссылка.Транзит 
		               |			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыПриходов.НаСклад)
		               |		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыПриходов.НаТранзит)
		               |	КОНЕЦ,
		               |	ПриходнаяПокупки.ОтдельнымМестом КАК ОтдельнымМестом,
		               |	ПриходнаяПокупки.Участник
		               |ИЗ
		               |	Документ.Приходная.Покупки КАК ПриходнаяПокупки
		               |ГДЕ
		               |	ПриходнаяПокупки.Ссылка = &Ссылка
		               |	И НЕ ПриходнаяПокупки.Ссылка.ДелаемГрупповойСтикер";
	КонецЕсли;	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция Получить_ТекстЗапроса_Транзит(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "Транзит";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.Приходная") Тогда
		ТекстЗапроса = "
		|
		|ВЫБРАТЬ
		|	ПриходнаяПосылки.Ссылка.Дата 		КАК Период,
		|	ПриходнаяПосылки.Посылка 			КАК ПокупкаСсылка,
		|	ПриходнаяПосылки.МестоХранения 		КАК МестоХранения,
		|	ПриходнаяПосылки.Габарит 			КАК Габарит,
		|	ПриходнаяПосылки.Посылка.Участник 	КАК Участник,
		|	Выбор когда ПриходнаяПосылки.Посылка.ПунктВыдачи = &Курьер100сп Тогда ПриходнаяПосылки.Посылка.ПунктВыдачи
		|	Иначе ПриходнаяПосылки.ПунктВыдачи Конец КАК Точка,
		|	ПриходнаяПосылки.Ссылка 			КАК Партия,
		|	1 КАК Количество
		|ИЗ
		|	Документ.Приходная.Посылки КАК ПриходнаяПосылки
		|ГДЕ
		|	ПриходнаяПосылки.Отправлено и
	//	|	&ВозможностьИспользоватьТранзит и
		//|	И ПриходнаяПосылки.Ссылка.Транзит
		|	(ПриходнаяПосылки.ПунктВыдачи <> &СвойПунктВыдачи или
		|	   ПриходнаяПосылки.Посылка.ПунктВыдачи = &Курьер100сп)
		|	И ПриходнаяПосылки.Ссылка = &Ссылка
		|	И не ПриходнаяПосылки.Ссылка.ДелаемГрупповойСтикер
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриходнаяПокупки.Ссылка.Дата,
		|	ПриходнаяПокупки.Покупка,
		|	ПриходнаяПокупки.МестоХранения,
		|	ПриходнаяПокупки.Габарит,
		|	ПриходнаяПокупки.Участник,
		|	ПриходнаяПокупки.Ссылка.ПунктВыдачи,
		|	ПриходнаяПокупки.Ссылка,
		|	Выбор когда ТипЗначения(ПриходнаяПокупки.Покупка)=Тип(Справочник.Коробки) Тогда 1 Иначе ПриходнаяПокупки.Количество Конец как Количество
		|ИЗ
		|	Документ.Приходная.Покупки КАК ПриходнаяПокупки
		|ГДЕ
		|	ПриходнаяПокупки.Ссылка.Транзит
		//|	и &ВозможностьИспользоватьТранзит 
		|	И ПриходнаяПокупки.Ссылка = &Ссылка
		|	И не ПриходнаяПокупки.Ссылка.ДелаемГрупповойСтикер
		|
		|";
	КонецЕсли;	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция Получить_ТекстЗапроса_КПолучению(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "КПолучению";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.Приходная") Тогда
		   
		ТекстЗапроса = "
					   |
					   |ВЫБРАТЬ
		               |	&Период КАК Период,
		               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		               |	КПолучениюОстатки.КоличествоОстаток КАК Количество,
		               |	КПолучениюОстатки.ДокументВыдачи КАК ДокументВыдачи,
		               |	КПолучениюОстатки.Покупка КАК Покупка,
		               |	КПолучениюОстатки.Участник КАК Участник
		               |ИЗ
		               |	РегистрНакопления.КПолучению.Остатки(
		               |			ДОБАВИТЬКДАТЕ(&Период, СЕКУНДА, -1),
		               |			(Участник, Покупка) В
		               |				(ВЫБРАТЬ
		               |					ПриходнаяПокупки.Участник КАК Участник,
		               |					ПриходнаяПокупки.Покупка КАК Покупка
		               |				ИЗ
		               |					Документ.Приходная.Покупки КАК ПриходнаяПокупки
		               |				ГДЕ
		               |					ПриходнаяПокупки.Ссылка = &Ссылка
		               |			
		               |				ОБЪЕДИНИТЬ ВСЕ
		               |			
		               |				ВЫБРАТЬ
		               |					ПриходнаяПосылки.Посылка.Участник,
		               |					ПриходнаяПосылки.Посылка
		               |				ИЗ
		               |					Документ.Приходная.Посылки КАК ПриходнаяПосылки
		               |				ГДЕ
		               |					ПриходнаяПосылки.Ссылка = &Ссылка)) КАК КПолучениюОстатки
		               |ГДЕ
		               |	КПолучениюОстатки.КоличествоОстаток > 0
					   |
					   |";
	КонецЕсли;	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции

Функция Получить_ТекстЗапроса_ОстаткиНаСкладе(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "ОстаткиНаСкладе";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.Приходная") Тогда
		ТекстЗапроса ="ВЫБРАТЬ
		              |	ПриходнаяПосылки.Ссылка.Дата КАК Период,
		              |	ПриходнаяПосылки.ШК КАК ШК,
		              |	ПриходнаяПосылки.Ссылка.ПунктВыдачи КАК ПунктВыдачи,
		              |	ПриходнаяПосылки.МестоХранения КАК МестоХранения,
		              |	ПриходнаяПосылки.Габарит КАК Габарит,
		              |	ПриходнаяПосылки.Ссылка КАК Партия,
		              |	1 КАК Количество,
		              |	ПриходнаяПосылки.Посылка.Участник КАК Участник
		              |ИЗ
		              |	Документ.Приходная.Посылки КАК ПриходнаяПосылки
		              |ГДЕ
		              |	ПриходнаяПосылки.Ссылка = &Ссылка
		              |	И ПриходнаяПосылки.Отправлено
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	ПриходнаяПокупки.Ссылка.Дата,
		              |	ПриходнаяПокупки.ШК,
		              |	ПриходнаяПокупки.Ссылка.ПунктВыдачи,
		              |	ПриходнаяПокупки.МестоХранения,
		              |	ПриходнаяПокупки.Габарит,
		              |	ПриходнаяПокупки.Ссылка,
		              |	ВЫБОР
		              |		КОГДА ТИПЗНАЧЕНИЯ(ПриходнаяПокупки.Покупка) = ТИП(Справочник.Коробки)
		              |			ТОГДА 1
		              |		ИНАЧЕ ПриходнаяПокупки.Количество
		              |	КОНЕЦ,
		              |	ПриходнаяПокупки.Участник
		              |ИЗ
		              |	Документ.Приходная.Покупки КАК ПриходнаяПокупки
		              |ГДЕ
		              |	ПриходнаяПокупки.Ссылка = &Ссылка";
	КонецЕсли;	

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции




Функция Получить_ТекстЗапроса_ШтрафныеЗаказы(Запрос, ТекстыЗапроса, Регистры) Экспорт
	ИмяРегистра = "ШтрафныеЗаказы";
	Если НЕ ПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 
	
	Если ТипЗнч(Запрос.Параметры.Ссылка)=Тип("ДокументСсылка.Приходная") Тогда
		
		ТекстЗапроса = 
		
		
		
		
		"ВЫБРАТЬ
		|	ПриходнаяПосылки.Ссылка.Дата КАК Период,
		|	ЗНАЧЕНИЕ(Справочник.Коробки.БезКоробки) КАК Коробка,
		|	ПриходнаяПосылки.Посылка.Организатор КАК Организатор,
		|	ПриходнаяПосылки.ПунктВыдачи,
		|	0 КАК Разобрано,
		|	0 КАК Штраф,
		|	0 КАК ГруппыНаТранзит,
		|	СУММА(1) КАК Одиночные
		|ИЗ
		|	Документ.Приходная.Посылки КАК ПриходнаяПосылки
		|ГДЕ
		|	ПриходнаяПосылки.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ПриходнаяПосылки.Ссылка.Дата,
		|	ПриходнаяПосылки.Посылка.Организатор,
		|	ПриходнаяПосылки.ПунктВыдачи,
		|	ЗНАЧЕНИЕ(Справочник.Коробки.БезКоробки)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПриходнаяПокупки.Ссылка.Дата,
		|	ПриходнаяПокупки.Покупка,
		|	ПриходнаяПокупки.Организатор,
		|	ПриходнаяПокупки.Ссылка.ПунктВыдачи,
		|	0,
		|	0,
		|	ПриходнаяПокупки.Покупка.Количество,
		|	0
		|ИЗ
		|	Документ.Приходная.Покупки КАК ПриходнаяПокупки
		|ГДЕ
		|	ПриходнаяПокупки.Ссылка = &Ссылка
		|	И ТИПЗНАЧЕНИЯ(ПриходнаяПокупки.Покупка) = ТИП(Справочник.Коробки)";
	КонецЕсли;
	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	Возврат ТекстЗапроса;

КонецФункции
